

#第一个代码的参数

threshold = 3     #筛选特征使用的阈值，（正样本概率/负样本概率） 大于此阈值的特征才被选择

#第二个代码无需修改的参数


#第三个代码

Promoter_path = 'promoter'               #此物种启动子文件路径
non_Promoter_path = 'non-promoter'       #此物种非启动子文件路径

chose_box = 'AT'                         #选择使用的Box

n = 10                                     #阈值，重要！！！！！！！！！！
                                          #序列中出现的次数高于此值，才算是正样本
                                          
#混淆矩阵结果存放在plt_confusion_matrix文件夹中
#保存格式：正样本的精确度，正样本的召回率，负样本的精确度，负样本的召回率，整体准确率，mcc值







#每一个文件夹功能：all_stastic：里面的内容我提供，是通过CUBT的预处理中的一部得到的  
#                      result_1：通过第一个代码筛选出来的特征
#                      结果：result_11.txt 里面的是正样本预测正样本所用的特征（预测对的）
#                            result_01.txt 里面的是负样本预测正样本所用的特征 （预测错误的）
                            